w2016561536/PX4-Autopilot/platforms/nuttx/src/px4/espressif/esp32_common/adc/esp_adc.c
#endif  /* CONFIG_ESPRESSIF_ADC_1 */

#ifdef CONFIG_ESPRESSIF_ADC_2
static struct esp_adc_dev_s g_adcpriv2 =
{
  .common = &g_adc_common,
  .initialized = false,
  .unit = ADC_UNIT_2,
  .atten_mode = CONFIG_ESPRESSIF_ADC_2_ATTENUATION,
#ifdef CONFIG_ESPRESSIF_ADC_2_MODE_ONE_SHOT
  .mode = ESP_ADC_MODE_ONE_SHOT,
#else
  .mode = ESP_ADC_MODE_CONTINUOUS,
#endif
};

static struct adc_dev_s g_adcdev2 =
{
  .ad_ops      = &g_adcops,
  .ad_priv     = &g_adcpriv2,
};
#endif  /* CONFIG_ESPRESSIF_ADC_2 */

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp_adc_bind
 *
 * Description:
 *   This function binds the upper-half driver callback to the ADC device.
 *
 * Input Parameters:
 *   dev      - Pointer to the ADC device structure.
 *   callback - Pointer to the upper-half driver callback structure.
 *
 * Returned Value:
 *   Returns OK on successful binding.
 *
 ****************************************************************************/

static int esp_adc_bind(struct adc_dev_s *dev,
                        const struct adc_callback_s *callback)
{
  struct esp_adc_dev_s *priv = (struct esp_adc_dev_s *)dev->ad_priv;

  DEBUGASSERT(priv);

  priv->cb = callback;

  return OK;
}

/****************************************************************************
 * Name: esp_adc_reset
 *
 * Description:
 *   This function resets the ADC device.
 *
 * Input Parameters:
 *   dev - Pointer to the ADC device structure.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp_adc_reset(struct adc_dev_s *dev)
{
  struct esp_adc_dev_s *priv = (struct esp_adc_dev_s *)dev->ad_priv;

  DEBUGASSERT(priv);
}

/****************************************************************************
 * Name: esp_adc_setup
 *
 * Description:
 *   This function sets up the ADC device.
 *
 * Input Parameters:
 *   dev - Pointer to the ADC device structure.
 *
 * Returned Value:
 *   Returns OK on successful setup; ERROR if the peripheral is already
 *   initialized.
 *
 ****************************************************************************/

static int esp_adc_setup(FAR struct adc_dev_s *dev)
{
  struct esp_adc_dev_s *priv = (struct esp_adc_dev_s *) dev->ad_priv;
  int ret = OK;

  DEBUGASSERT(priv);

  if (priv->common->initialized)
    {
      awarn("peripheral already initialized\n");
      return ERROR;
    }

  priv->common->initialized = true;

  return ret;
}

/****************************************************************************
 * Name: esp_adc_shutdown
 *
 * Description:
 *   This function shuts down the ADC device.
 *
 * Input Parameters:
 *   dev - Pointer to the ADC device structure.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp_adc_shutdown(FAR struct adc_dev_s *dev)
{
  struct esp_adc_dev_s *priv = (struct esp_adc_dev_s *) dev->ad_priv;

  DEBUGASSERT(priv);

  if (!priv->common->initialized)
    {
      return;
    }

  priv->common->initialized = false;
}

/****************************************************************************
 * Name: esp_adc_rxint
 *
 * Description:
 *   This function enables or disables ADC receive interrupts.
 *
 * Input Parameters:
 *   dev    - Pointer to the ADC device structure.
 *   enable - Boolean indicating whether to enable (true) or disable (false)
 *            the receive interrupts.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp_adc_rxint(FAR struct adc_dev_s *dev, bool enable)
{
  struct esp_adc_dev_s *priv = (struct esp_adc_dev_s *) dev->ad_priv;

  DEBUGASSERT(priv);
}

/****************************************************************************
 * Name: esp_adc_ioctl
 *
 * Description:
 *   This function handles ADC ioctl commands.
 *
 * Input Parameters:
 *   dev  - Pointer to the ADC device structure.
 *   cmd  - The ioctl command.
 *   arg  - The argument for the ioctl command.
 *
 * Returned Value:
 *   Returns the number of channels on ANIOC_GET_NCHANNELS command; a negated
 *   errno value is returned on any failure.
 *
 ****************************************************************************/

static int esp_adc_ioctl(struct adc_dev_s *dev, int cmd,
                         unsigned long arg)
{
  struct esp_adc_dev_s *priv = (struct esp_adc_dev_s *)dev->ad_priv;
  int ret = OK;

  DEBUGASSERT(priv);

  switch (cmd)
    {
      case ANIOC_TRIGGER:
        esp_adc_oneshot_read(dev);
        break;

      case ANIOC_GET_NCHANNELS:
        ret = priv->channels;
        break;

      default:
        aerr("ERROR: Unknown cmd: %d\n", cmd);
        ret = -ENOTTY;
        break;
    }

  return ret;
}

/****************************************************************************
 * Name: esp_adc_oneshot_read
 *
 * Description:
 *   This function reads data from the ADC device in one-shot mode.
 *
 * Input Parameters:
 *   dev - Pointer to the ADC device structure.
 *
 * Returned Value:
 *   Returns OK on successful read; ERROR if the ADC is not initialized.
 *
 ****************************************************************************/

static int esp_adc_oneshot_read(struct adc_dev_s *dev)
{
  struct esp_adc_dev_s *priv = (struct esp_adc_dev_s *)dev->ad_priv;
  adc_oneshot_hal_ctx_t *hal = &priv->os_dev.hal;
  struct esp_adc_oneshot_ch_s *ch;
  irqstate_t flags;
  int raw_value;
  int voltage;
  int i;
  int ret = OK;
#ifndef CONFIG_ARCH_CHIP_ESP32
    adc_atten_t atten;
#endif

  DEBUGASSERT(priv);
  DEBUGASSERT(priv->mode == ESP_ADC_MODE_ONE_SHOT);

  if (!priv->initialized)
    {
      aerr("ADC %d not initialized\n", priv->unit);
      return ERROR;
    }

  /* Read all configured channels */

