w2016561536/PX4-Autopilot/platforms/nuttx/src/px4/espressif/esp32_common/adc/esp_adc.c
  for (i = 0; i < priv->channels; i++)
    {
      ch = &priv->os_dev.ch_list[i];
      flags = spin_lock_irqsave(&g_adc_common.esp_adc_spinlock);

      /* Read the ADC value */

      adc_oneshot_hal_setup(hal, ch->channel);
#ifndef CONFIG_ARCH_CHIP_ESP32
      if (ch->calibrated)
        {
          atten = adc_ll_get_atten(priv->unit, ch->channel);
          adc_hal_calibration_init(priv->unit);
          adc_set_hw_calibration_code(priv->unit, atten);
        }
#endif

      ret = adc_oneshot_hal_convert(hal, &raw_value);
      if (!ret)
        {
          aerr("invalid one-shot ADC read\n");
        }

      /* Apply calibration if possible */

      if (ch->calibrated)
        {
          ret = adc_cali_raw_to_voltage(ch->cali_handle,
                                        raw_value,
                                        &voltage);
          if (ret != OK)
            {
              voltage = 0;
              aerr("apply calibration failed\n");
            }
        }
      else
        {
          voltage = priv->atten_k * raw_value / 4095;
        }

      /* Inform upper layer that new data for a channel is available */

      priv->cb->au_receive(dev, ch->channel, (int32_t)voltage);

      spin_unlock_irqrestore(&g_adc_common.esp_adc_spinlock, flags);

      ainfo("read adc %d ch %d (cali: %d): value %" PRId32 " (raw %d)\n",
            priv->unit, ch->channel, ch->calibrated,
            (int32_t)voltage, raw_value);
       usleep(1000);
    }

  return OK;
}


uint32_t esp_adc_oneshot_read_now(struct adc_dev_s *dev, uint8_t channel_id)
{
  struct esp_adc_dev_s *priv = (struct esp_adc_dev_s *)dev->ad_priv;
  adc_oneshot_hal_ctx_t *hal = &priv->os_dev.hal;
  struct esp_adc_oneshot_ch_s *ch;
  irqstate_t flags;
  int raw_value;
  int voltage;
  int i;
  int ret = OK;
#ifndef CONFIG_ARCH_CHIP_ESP32
    adc_atten_t atten;
#endif

  DEBUGASSERT(priv);
  DEBUGASSERT(priv->mode == ESP_ADC_MODE_ONE_SHOT);

  if (!priv->initialized)
    {
      aerr("ADC %d not initialized\n", priv->unit);
      return ERROR;
    }

  /* Read all configured channels */

  for (i = 0; i < priv->channels; i++)
    {
      ch = &priv->os_dev.ch_list[i];
      if (channel_id != ch->channel){
        continue;
      }
      flags = spin_lock_irqsave(&g_adc_common.esp_adc_spinlock);

      /* Read the ADC value */

      adc_oneshot_hal_setup(hal, ch->channel);
#ifndef CONFIG_ARCH_CHIP_ESP32
      if (ch->calibrated)
        {
          atten = adc_ll_get_atten(priv->unit, ch->channel);
          adc_hal_calibration_init(priv->unit);
          adc_set_hw_calibration_code(priv->unit, atten);
        }
#endif

      ret = adc_oneshot_hal_convert(hal, &raw_value);
      if (!ret)
        {
          aerr("invalid one-shot ADC read\n");
        }

      /* Apply calibration if possible */

      if (ch->calibrated)
        {
          ret = adc_cali_raw_to_voltage(ch->cali_handle,
                                        raw_value,
                                        &voltage);
          if (ret != OK)
            {
              voltage = 0;
              aerr("apply calibration failed\n");
            }
        }
      else
        {
          voltage = priv->atten_k * raw_value / 4095;
        }

      /* Inform upper layer that new data for a channel is available */

      // priv->cb->au_receive(dev, ch->channel, (int32_t)voltage);

      spin_unlock_irqrestore(&g_adc_common.esp_adc_spinlock, flags);

      ainfo("read adc %d ch %d (cali: %d): value %" PRId32 " (raw %d)\n",
            priv->unit, ch->channel, ch->calibrated,
            (int32_t)voltage, raw_value);
//       usleep(1000);
        return voltage * 4095 / priv->atten_k;

    }

  return OK;
}

/****************************************************************************
 * Name: esp_adc_oneshot_new_unit
 *
 * Description:
 *   This function initializes a new ADC unit in one-shot mode.
 *
 * Input Parameters:
 *   dev - Pointer to the ADC device structure.
 *
 * Returned Value:
 *   Returns OK on successful initialization; ERROR if the ADC is already
 *   initialized.
 *
 ****************************************************************************/

static int esp_adc_oneshot_new_unit(struct adc_dev_s *dev)
{
  struct esp_adc_dev_s *priv = (struct esp_adc_dev_s *)dev->ad_priv;
  adc_oneshot_hal_ctx_t *hal = &priv->os_dev.hal;
  adc_oneshot_hal_cfg_t config;
  irqstate_t flags;
  uint32_t clk_src_freq_hz = 0;

  DEBUGASSERT(priv);
  DEBUGASSERT(priv->mode == ESP_ADC_MODE_ONE_SHOT);

  if (priv->initialized)
    {
      aerr("ADC %d already initialized\n", priv->unit);
      return ERROR;
    }

  flags = spin_lock_irqsave(&g_adc_common.esp_adc_spinlock);

  esp_clk_tree_src_get_freq_hz((soc_module_clk_t )SOC_MOD_CLK_APB,
                               ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED,
                               &clk_src_freq_hz);

  config.unit = priv->unit;
  config.work_mode = ADC_HAL_SINGLE_READ_MODE;
  config.clk_src = (adc_oneshot_clk_src_t )SOC_MOD_CLK_APB;
  config.clk_src_freq_hz = clk_src_freq_hz;

  adc_oneshot_hal_init(hal, &config);

  /* Enable peripheral and power ADC */

  adc_apb_periph_claim();

  sar_periph_ctrl_adc_oneshot_power_acquire();

  /* Acquire oneshot mode power */

#ifndef ARCH_CHIP_ESP32S2
  sar_ctrl_ll_set_power_mode(SAR_CTRL_LL_POWER_ON);
#endif

  priv->initialized = true;

  spin_unlock_irqrestore(&g_adc_common.esp_adc_spinlock, flags);

  ainfo("unit %d freq %" PRIu32 "\n", priv->unit, clk_src_freq_hz);
  return OK;
}

/****************************************************************************
 * Name: esp_adc_oneshot_config_channel
 *
 * Description:
 *   This function configures a specific channel for the ADC device in
 *   one-shot mode.
 *
 * Input Parameters:
 *   dev     - Pointer to the ADC device structure.
 *   channel - The channel number to configure.
 *
 * Returned Value:
 *   Returns OK on successful configuration; a negated errno value is
 *   returned on any failure.
 *
 ****************************************************************************/

