w2016561536/PX4-Autopilot/platforms/nuttx/src/px4/espressif/esp32_common/adc/esp_adc.c
static int esp_adc_oneshot_config_channel(struct adc_dev_s *dev,
                                          uint8_t channel)
{
  struct esp_adc_dev_s *priv = (struct esp_adc_dev_s *)dev->ad_priv;
  adc_oneshot_hal_ctx_t *hal = &priv->os_dev.hal;
  adc_oneshot_hal_chan_cfg_t config;
  irqstate_t flags;
  int gpio;
  int ret;

  DEBUGASSERT(priv);
  DEBUGASSERT(priv->mode == ESP_ADC_MODE_ONE_SHOT);

  config.atten = priv->atten_mode;
  config.bitwidth = ESP_ADC_BITWIDTH_DEFAULT;

  /* Configure GPIO for ADC */

  gpio = ADC_GET_IO_NUM(priv->unit, channel);
  ret = esp_configgpio(gpio, GPIO_ADC_FUNCTION);
  if (ret < 0)
    {
      aerr("ERROR: Failed to configure GPIO %d\n", gpio);
      return ret;
    }

  /* Config ADC channel */

  flags = spin_lock_irqsave(&g_adc_common.esp_adc_spinlock);
  adc_oneshot_hal_channel_config(hal, &config, channel);
  spin_unlock_irqrestore(&g_adc_common.esp_adc_spinlock, flags);

  ainfo("init adc unit %u, ch %u (gpio %d), atten %d, bitwidth %d",
        priv->unit, channel, gpio, config.atten, config.bitwidth);

  return OK;
}

/****************************************************************************
 * Name: esp_adc_calibrate
 *
 * Description:
 *   This function calibrates the ADC device.
 *
 * Input Parameters:
 *   dev - Pointer to the ADC device structure.
 *
 * Returned Value:
 *   Returns OK on successful calibration; a negated errno value is returned
 *   on any failure.
 *
 ****************************************************************************/

static int esp_adc_calibrate(struct adc_dev_s *dev)
{
  struct esp_adc_dev_s *priv = (struct esp_adc_dev_s *)dev->ad_priv;
  adc_cali_handle_t *handle;
#ifdef ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
  adc_cali_curve_fitting_config_t cali_config;
#else
  adc_cali_line_fitting_config_t cali_config;
#endif
  int i;
  int ret = OK;

  DEBUGASSERT(priv);
  DEBUGASSERT(priv->mode == ESP_ADC_MODE_ONE_SHOT);

  /* Init calibration for this ADC unit */

#ifndef CONFIG_ARCH_CHIP_ESP32
  adc_hal_calibration_init(priv->unit);
  adc_calc_hw_calibration_code(priv->unit, priv->atten_mode);
#endif

  cali_config.unit_id = priv->unit;
  cali_config.atten = priv->atten_mode;
  cali_config.bitwidth = ESP_ADC_BITWIDTH_DEFAULT;

  for (i = 0; i < priv->channels; i++)
    {
      handle = &priv->os_dev.ch_list[i].cali_handle;
#ifdef ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
      cali_config.chan = priv->os_dev.ch_list[i].channel;

      ainfo("curve fitting unit %d, chan %u, atten %u, bitwidth %u\n",
            cali_config.unit_id, cali_config.chan, cali_config.atten,
            cali_config.bitwidth);

      /* Make sure calibration handle is clear */

      if (*handle != NULL)
        {
          adc_cali_delete_scheme_curve_fitting(*handle);
        }

      ret = adc_cali_create_scheme_curve_fitting(&cali_config, handle);
#endif
#ifdef ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
#ifdef CONFIG_ARCH_CHIP_ESP32
      cali_config.default_vref = ADC_ESP32_DEFAULT_VREF_INTERNAL;
#endif
      ainfo("line fitting unit %d, atten %u, bitwidth %u\n",
            cali_config.unit_id, cali_config.atten, cali_config.bitwidth);

      /* Make sure calibration handle is clear */

      if (*handle != NULL)
        {
          adc_cali_delete_scheme_line_fitting(*handle);
        }

      ret = adc_cali_create_scheme_line_fitting(&cali_config, handle);
#endif
      if (ret == OK)
        {
          priv->os_dev.ch_list[i].calibrated = true;
        }
      else
        {
          aerr("calibration failed\n");
        }
    }

  /* This attenuation constant is used when calibration fails,
   * returning a voltage obtained from simple calibration based
   * on: Vdata = Vref * raw_data / 4095
   */

  switch (priv->atten_mode)
    {
      case ADC_ATTEN_DB_12:
        priv->atten_k = 4400;
        break;

      case ADC_ATTEN_DB_6:
        priv->atten_k = 2200;
        break;

      case ADC_ATTEN_DB_2_5:
        priv->atten_k = 1470;
        break;

      case ADC_ATTEN_DB_0:
        priv->atten_k = 1100;
        break;

      default:
        priv->atten_k = 0;
        aerr("invalid attenuation mode\n");
        break;
    }

  return ret;
}

/****************************************************************************
 * Name: esp_adc_initialize
 *
 * Description:
 *   This function initializes the specified ADC device with the provided
 *   configuration.
 *
 * Input Parameters:
 *   adc_num      - The ADC unit number.
 *   channel_list - List of channels to be configured for the ADC unit.
 *
 * Returned Value:
 *   Returns a valid pointer to the ADC device structure on success; NULL on
 *   any failure.
 *
 ****************************************************************************/

struct adc_dev_s *esp_adc_initialize(int adc_num,
                                     const uint8_t *channel_list)
{
  struct adc_dev_s *dev;
  struct esp_adc_dev_s *priv;
  uint8_t channel;
  // int gpio;
  int i;

  ainfo("initialize SAR ADC %d\n", adc_num);

  switch (adc_num)
    {
      case 1:
        {
#ifdef CONFIG_ESPRESSIF_ADC_1
          dev = &g_adcdev1;
          priv = &g_adcpriv1;
          break;
#endif
        }

      case 2:
        {
#ifdef CONFIG_ESPRESSIF_ADC_2
          dev = &g_adcdev2;
          priv = &g_adcpriv2;
#endif
          break;
        }

      default:
        {
          aerr("ERROR: Unsupported ADC number: %d\n", adc_num);
          return NULL;
        }
    }

  /* Get number of channels used. ESP32 is an exception since unit 1
   * has 8 channels instead of 10.
   */

#ifdef CONFIG_ARCH_CHIP_ESP32
  if (priv->unit == ADC_UNIT_1)
    {
      priv->channels = COUNT_NON_ZERO(channel_list,
                                      SOC_ADC_MAX_CHANNEL_NUM - 2);
    }
  else
    {
      priv->channels = COUNT_NON_ZERO(channel_list, SOC_ADC_MAX_CHANNEL_NUM);
    }
#else
  priv->channels = COUNT_NON_ZERO(channel_list, SOC_ADC_MAX_CHANNEL_NUM);
#endif

  if (priv->channels == 0)
    {
      aerr("ERROR: No channels configured\n");
      return NULL;
    }

  /* Setup this ADC unit to one-shot mode */

  esp_adc_oneshot_new_unit(dev);

  /* Configure channels that will be used for this ADC unit. */

  for (i = 0; i < priv->channels; i++)
    {
      /* Decrement channel number by 1 to get correct index */

      channel = channel_list[i] - 1;
      priv->os_dev.ch_list[i].channel = channel;

      esp_adc_oneshot_config_channel(dev, channel);
    }

  esp_adc_calibrate(dev);

  return dev;
}
